In [2]:
import pandas as pd

In [3]:
data = {
    'City ': ['Tokyo', 'Delhi', 'Shanghai', 'Sao Paulo', 'Mumbai'],
    ' Country': ['Japan', 'India', 'China', 'Brazil', 'India'],
    'Population Millions': [37.3, 32.0, 28.5, 22.4, 20.4]
}

df = pd.DataFrame(data)
display(df)

       City   Country  Population Millions
0      Tokyo    Japan                 37.3
1      Delhi    India                 32.0
2   Shanghai    China                 28.5
3  Sao Paulo   Brazil                 22.4
4     Mumbai    India                 20.4

In [8]:
display(df.columns)

Index(['City ', ' Country', 'Population Millions'], dtype='object')

In [ ]:
df.columns.str.lstrip()

Index(['City ', 'Country', 'Population Millions'], dtype='object')

In [10]:
df.columns.str.rstrip()

Index(['City', ' Country', 'Population Millions'], dtype='object')

In [ ]:
df.columns.str.replace(" ", "_")

Index(['City', 'Country', 'PopulationMillions'], dtype='object')

In [12]:
data = {
    'City': ['Tokyo', 'Delhi', 'Shanghai', 'Sao Paulo', 'Mumbai'],
    'Country': ['Japan', 'India', 'China', 'Brazil', 'India'],
    'Population_Millions': [37.3, 32.0, 28.5, 22.4, 20.4],
    25: [1,2,3,4,5]
}

df = pd.DataFrame(data)
display(df)

        City Country  Population_Millions  25
0      Tokyo   Japan                 37.3   1
1      Delhi   India                 32.0   2
2   Shanghai   China                 28.5   3
3  Sao Paulo  Brazil                 22.4   4
4     Mumbai   India                 20.4   5

In [13]:
df.columns.str.replace(" ", "_")

Index(['City', 'Country', 'Population_Millions', nan], dtype='object')

In [15]:
df.columns.astype(str).str.replace(" ", "_")

Index(['City', 'Country', 'Population_Millions', '25'], dtype='object')